# DataFrame에서 데이터 추출 ----------------------------------

 - 열(컬럼 column 세로벡터) 단위 데이터 추출
     - 방식 : DF객체변수명[컬러명] 또는 DF객체변수명.컬럼명
 
 - 행(로우 row 가로벡터) 단위 데이터 추출
     - 방식 : DF객체변수명.loc[ 인덱스라벨 ] 또는 DF객체변수명.iloc[ 정수인덱스 ]
     
     
 - 원소 단위 데이터 추출
     - 방식 : DF객체변수명.loc[ 행인덱스라벨, 열인덱스라벨 ] 또는 [행인덱스라벨]
     [열인덱스라벨]
              DF객체변수명.iloc[ 행인덱스, 열인덱스 ] 또는 [행인덱스][열인덱스]

In [5]:
# 모듈 로딩 ---------------------------------------------
import pandas as pd

# DF객체 생성 -------------------------------------------
df=pd.DataFrame(([1,2,3], [11,22,33]))

# DF객체 요약 정보 출력 메서드
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [93]:
# DF객체 구성 확인
df

   one  two  three
0    1    2      3
1   11   22     33

# 열 (세로) 데이터 추출

In [92]:
# DF객체변수명[컬럼명]
twoCol=df[0,1]

print(f'twoCol => \n{twoCol}', f'twoCol Type => {type(twoCol)}',sep='\n')

KeyError: (0, 1)

In [89]:
# DF객체의 column 송성변경
df.columns=['one', 'two', 'three']
df

   one  two  three
0    1    2      3
1   11   22     33

In [90]:
twoCol=df['one':'three']
print(f'twoCol => \n{twoCol}',f'twoCol Type => {type(twoCol)}',sep='\n')

TypeError: cannot do slice indexing on RangeIndex with these indexers [one] of type str

# 행(row, 가로) 데이터 추출 -------------------------------
    - DF객체변수명.loc

In [19]:
# 11, 22, 33 라인 전체 추출
df['one']

0     1
1    11
Name: one, dtype: int64

In [28]:
# 11, 22, 33 라인 전체 추출
oneRow=df.iloc[1]

print(f'oneRow => \n{oneRow}', f'oneRow Type => {type(oneRow)}',sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type => <class 'pandas.core.series.Series'>

In [26]:
twoRow=df.iloc[0,1]

print(f'twoRow => \n{twoRow}', f'twoRow Type => {type(twoRow)}',sep='\n')

twoRow =>
2
twoRow Type => <class 'numpy.int64'>

In [38]:
exam_data = {'수학':[99,80,79], '영어':[100,100,100],
             '음악':[88,91,89], '체육':[90,90,90]}

df1 = pd.DataFrame(exam_data, index=['서준','우현','인아'])
df1

    수학   영어  음악  체육
서준  99  100  88  90
우현  80  100  91  90
인아  79  100  89  90

In [39]:
df1.iloc[1]

수학     80
영어    100
음악     91
체육     90
Name: 우현, dtype: int64

In [40]:
# 우현학생의 성적만 추출
oneRow=df1.loc['우현']
oneRow

수학     80
영어    100
음악     91
체육     90
Name: 우현, dtype: int64

In [41]:
# 인하학생의 성적만 추출
oneRow = df1.iloc[2]
oneRow

수학     79
영어    100
음악     89
체육     90
Name: 인아, dtype: int64

In [42]:
# 음악과목의 성적만 추출
oneCol=df1.음악
oneCol

서준    88
우현    91
인아    89
Name: 음악, dtype: int64

In [43]:
oneCol=df1['음악']
oneCol

서준    88
우현    91
인아    89
Name: 음악, dtype: int64

In [45]:
# DF에서 원소 추출 => iloc[ 행, 열 ] 또는 loc[ 행, 열]
woo=df1.loc['우현', '음악']

print(f'woo => {woo}', f'woo type => {type(woo)}', sep='\n')

woo => 91
woo type => <class 'numpy.int64'>

In [46]:
df1

    수학   영어  음악  체육
서준  99  100  88  90
우현  80  100  91  90
인아  79  100  89  90

In [49]:
#select = df1[1][2]
#select                        - 실행 X
select = df1['수학'][2]
select

79

In [50]:
oneCol=df1['수학']
oneCol[2]

79

In [51]:
select = df1['수학'][[1,2]]

select

우현    80
인아    79
Name: 수학, dtype: int64

# DF에 행과 열 추가하기 --------------------------------

- 행 추가 => DF객체변수명.loc[행라벨] = 데이터

- 열 추가 => DF객체변수명[컬럼] = 데이터

In [52]:
# DF 데이터 확인
df1

    수학   영어  음악  체육
서준  99  100  88  90
우현  80  100  91  90
인아  79  100  89  90

In [53]:
# 행(row) 추가하기 -----------------------------------
df1.loc['호진']=[100, 100, 100, 100]
df1

     수학   영어   음악   체육
서준   99  100   88   90
우현   80  100   91   90
인아   79  100   89   90
호진  100  100  100  100

In [55]:
#df1.loc['나령']=[100,100]

In [56]:
df1.loc['나령']=100
df1

     수학   영어   음악   체육
서준   99  100   88   90
우현   80  100   91   90
인아   79  100   89   90
호진  100  100  100  100
나령  100  100  100  100

In [58]:
# 열(column) 추가하기 ---------------------
df1['국어']=[100, 100, 100, 100, 100]
df1

     수학   영어   음악   체육   국어
서준   99  100   88   90  100
우현   80  100   91   90  100
인아   79  100   89   90  100
호진  100  100  100  100  100
나령  100  100  100  100  100

In [59]:
df1['국어']=[0,0,0,0,1]
df1

     수학   영어   음악   체육  국어
서준   99  100   88   90   0
우현   80  100   91   90   0
인아   79  100   89   90   0
호진  100  100  100  100   0
나령  100  100  100  100   1

In [62]:
df1['나령']=2000
df1

     수학   영어   음악   체육  국어    나령
서준   99  100   88   90   0  2000
우현   80  100   91   90   0  2000
인아   79  100   89   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

# DF에서 행과 열 삭제하기 -------------------------

- 삭제 관련 메서드 => drop( )
    - 행 삭제 : DF객체변수명.drop(행, axis=0)   <- axis=0 행 기본값
    - 열 삭제 : DF객체변수명.drop(열, axis=1)
    

- drop() 특징
    - 실제 데이터 삭제하지 않음   => 복사본에서 데이터 삭제하고 복사본 반환
    - 실제 데이터 삭제하기   => inplace = True

In [63]:
df1

     수학   영어   음악   체육  국어    나령
서준   99  100   88   90   0  2000
우현   80  100   91   90   0  2000
인아   79  100   89   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [64]:
# 인아 학생 성적 제거 =====> 행(row)
df1.drop('인아')

     수학   영어   음악   체육  국어    나령
서준   99  100   88   90   0  2000
우현   80  100   91   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [65]:
df1

     수학   영어   음악   체육  국어    나령
서준   99  100   88   90   0  2000
우현   80  100   91   90   0  2000
인아   79  100   89   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [66]:
df2=df1.drop('인아')
df2

     수학   영어   음악   체육  국어    나령
서준   99  100   88   90   0  2000
우현   80  100   91   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [74]:
df3=df1.drop('인아', inplace=True)
print(df3)

None

In [72]:
df1

     수학   영어   음악   체육  국어    나령
우현   80  100   91   90   0  2000
인아   79  100   89   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [75]:
df1

     수학   영어   음악   체육  국어    나령
우현   80  100   91   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [77]:
df4=df1.drop('수학', axis=1)
df4

     영어   음악   체육  국어    나령
우현  100   91   90   0  2000
호진  100  100  100   0  2000
나령  100  100  100   1  2000

In [78]:
df1

     수학   영어   음악   체육  국어    나령
우현   80  100   91   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [79]:
# 열(column) 삭제 => 수학 컬럼
# => DF객체변수명.drop(행, axis=1, inplace=True)

# 행&열 전환 --------------------------------------

- 행 ==> 열,   열 ==> 행으로 변환

- 방법
        - 메서드 : DF객체변수명.transpose()
        - 속 성 : DF객체변수명.T

In [80]:
df1

     수학   영어   음악   체육  국어    나령
우현   80  100   91   90   0  2000
호진  100  100  100  100   0  2000
나령  100  100  100  100   1  2000

In [81]:
# DF 객체의 형태 => shape속성
df1.shape

(3, 6)

In [82]:
# 행 <-> 열 전환
df1.T

      우현    호진    나령
수학    80   100   100
영어   100   100   100
음악    91   100   100
체육    90   100   100
국어     0     0     1
나령  2000  2000  2000

In [84]:
df1.shape

(3, 6)

In [85]:
df1.transpose()

      우현    호진    나령
수학    80   100   100
영어   100   100   100
음악    91   100   100
체육    90   100   100
국어     0     0     1
나령  2000  2000  2000

In [87]:
df1=df1.transpose()
df1.shape

(6, 3)

In [ ]:
# 성적 DataFrame 객체 생성 ----------------------------------------------
#df2=pd.DataFrame({'수학':[100,98,99], '영어':[78,91,88]})